In [1]:
import sqlite3

In [2]:
db = sqlite3.connect("IMDB.sqlite")

In [3]:
db

In [4]:
# using sqlite3.connect we can connect to a database
# We provide the path of file inside the function and a connection is created.

# If there is no file of the name specified then a new file is created of that name 
# and a connection is established with it.

##### cursor

Cursor is a Temporary Memory or Temporary Work Station.

In [5]:
db = sqlite3.connect("School.sqlite")
db

In [6]:
cur = db.cursor()
cur

Now to run any sql query we do it through cursor.

We need to use the execute function to execute the query.

We can write the query directly inside execute function or pass a variable.

In [7]:
sql_query = 'create table Student (RollNo int Primary key,Name Text,Age int)'
cur.execute(sql_query)

In [8]:
cur.execute("Insert into Student values(101,'Amit',18)")

Changes do not reflect until we commit.

In [9]:
db.commit()

In [10]:
# closing the connection
db.close()

In [11]:
db = sqlite3.connect("School.sqlite")

In [12]:
cur = db.cursor()

In [13]:
cur.execute("Insert into Student values(103,'Mohit',24)")

In [14]:
db.commit()

##### ? Placeholder

In [15]:
rollNumber = 104
Name = "Aryan"
age = 21

cur.execute("Insert into Student values(?,?,?)",(rollNumber,Name,age))
db.commit()

###### It is important to note that while giving values to the placeholder a tuple must be passed even if we're just putting one value.

##### execuetmany

In [16]:
values = [(105,"Ayushi",24),(106,"Anjali",50),(107,"Raj",54)]

cur.executemany("Insert into Student values(?,?,?)",values)
db.commit()

##### Updating values

In [17]:
cur.execute("Update Student set age = 40 where Name = 'Amit'")
db.commit()

In [18]:
# IMPORTANT - SEE HOW WE NEED TO PASS A TUPLE EVEN WHEN ONE VALUE IS BEING UPDATED.
new_age = 30
cur.execute("Update Student set age = ? where Name = 'Mohit'",(new_age,))
db.commit()

##### Fetching data

There are two ways to do so :-
    * We can either treat the cur as an iterator
    * Use some functions

1.)Treating cur as an iterator

In [19]:
cur.execute("Select * from Student")

In [20]:
for i in cur:
    print(i)

(101, 'Amit', 40)
(103, 'Mohit', 30)
(104, 'Aryan', 21)
(105, 'Ayushi', 24)
(106, 'Anjali', 50)
(107, 'Raj', 54)

2.)Using fetch functions

There are three types of fetch functions:-
    * fetchone
    * fetchmany
    * fetchall

###### cur.fetchone()

In [21]:
cur.execute("Select * from Student")
cur.fetchone()

(101, 'Amit', 40)

In [22]:
# When we do fetchone once we get the first row.
# If we do it again the we get the second row and so on.
cur.fetchone()

(103, 'Mohit', 30)

###### cur.fetchmany()

In [23]:
# When we do fetchmany and do not provide number of rows we want we get one row.

In [24]:
cur.execute("Select * from Student")
print(cur.fetchmany())
print(cur.fetchmany())
print(cur.fetchmany())

[(101, 'Amit', 40)]
[(103, 'Mohit', 30)]
[(104, 'Aryan', 21)]

In [25]:
cur.execute("Select * from Student")
cur.fetchmany(3)

[(101, 'Amit', 40), (103, 'Mohit', 30), (104, 'Aryan', 21)]

###### cur.fetchall()

In [26]:
cur.execute("Select * from Student")
cur.fetchall()

[(101, 'Amit', 40),
 (103, 'Mohit', 30),
 (104, 'Aryan', 21),
 (105, 'Ayushi', 24),
 (106, 'Anjali', 50),
 (107, 'Raj', 54)]

### Connecting sqlite and Pandas

In [27]:
import sqlite3
import pandas as pd

db = sqlite3.connect("School.sqlite")

In [28]:
# We can read any sql db by using read_sql_query.
# We need to provide two parameter, first one is query and the other one is the name of the database.

data = pd.read_sql_query("Select * from Student",db)
data

   RollNo    Name  Age
0     101    Amit   40
1     103   Mohit   30
2     104   Aryan   21
3     105  Ayushi   24
4     106  Anjali   50
5     107     Raj   54

In [29]:
db.close()

##### Dataframe to sql.

In [30]:
# We can easily do this by using to_sql function.
db = sqlite3.connect("School.sqlite")
data = pd.DataFrame([[1001,"Manoj",100000],[1002,"Smriti",200000],[1003,"Venkat",100000]],columns = ["ID","Name","Salary"])
data

     ID    Name  Salary
0  1001   Manoj  100000
1  1002  Smriti  200000
2  1003  Venkat  100000

In [31]:
data.to_sql("Faculty",db)
db.close()

##### Updating table

In [32]:
db = sqlite3.connect("School.sqlite")

# Adding another columnn to Faculty table.
data["CurrentInstitute"] = "IIT-Delhi"

# Updating in our sql database table
data.to_sql("Faculty",db,if_exists = "replace")
db.close()